# Pandas

In [1]:
import pandas as pd

###### Veri Yapısı

Seriler

In [2]:
s = pd.Series([3,-5,7,4],index=['a','b','c','d'])

In [3]:
s

a    3
b   -5
c    7
d    4
dtype: int64

Dataframe

In [4]:
data ={'Country':['Belgium','India','Brazil'],
       'Capital':['Brussels','New Delhi','Brasilia'],
      'Population':[11190846,1303171835,207847528]}

In [6]:
df = pd.DataFrame(data, columns=['Country','Capital','Population'])

In [7]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171835
2   Brazil   Brasilia   207847528

###### Dropping

In [8]:
s.drop(['a','c'])

b   -5
d    4
dtype: int64

In [9]:
df.drop('Country',axis=1)

     Capital  Population
0   Brussels    11190846
1  New Delhi  1303171835
2   Brasilia   207847528

###### Yardım

In [10]:
help(pd.Series.loc)

Help on property:

    Access a group of rows and columns by label(s) or a boolean array.

    ``.loc[]`` is primarily label based, but may also be used with a
    boolean array.

    Allowed inputs are:

    - A single label, e.g. ``5`` or ``'a'``, (note that ``5`` is
      interpreted as a *label* of the index, and **never** as an
      integer position along the index).
    - A list or array of labels, e.g. ``['a', 'b', 'c']``.
    - A slice object with labels, e.g. ``'a':'f'``.

      .. warning:: Note that contrary to usual python slices, **both** the
          start and the stop are included

    - A boolean array of the same length as the axis being sliced,
      e.g. ``[True, False, True]``.
    - An alignable boolean Series. The index of the key will be aligned before
      masking.
    - An alignable Index. The Index of the returned selection will be the input.
    - A ``callable`` function with one argument (the calling Series or
      DataFrame) and that returns valid output for indexing (one of the above)

    See more at :ref:`Selection by Label <indexing.label>`.

    Raises
    ------
    KeyError
        If any items are not found.
    IndexingError
        If an indexed key is passed and its index is unalignable to the frame index.

    See Also
    --------
    DataFrame.at : Access a single value for a row/column label pair.
    DataFrame.iloc : Access group of rows and columns by integer position(s).
    DataFrame.xs : Returns a cross-section (row(s) or column(s)) from the
        Series/DataFrame.
    Series.loc : Access group of values using labels.

    Examples
    --------
    **Getting values**

    >>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
    ...      index=['cobra', 'viper', 'sidewinder'],
    ...      columns=['max_speed', 'shield'])
    >>> df
                max_speed  shield
    cobra               1       2
    viper               4       5
    sidewinder          7       8

    Single label. Note this returns the row as a Series.

    >>> df.loc['viper']
    max_speed    4
    shield       5
    Name: viper, dtype: int64

    List of labels. Note using ``[[]]`` returns a DataFrame.

    >>> df.loc[['viper', 'sidewinder']]
                max_speed  shield
    viper               4       5
    sidewinder          7       8

    Single label for row and column

    >>> df.loc['cobra', 'shield']
    2

    Slice with labels for row and single label for column. As mentioned
    above, note that both the start and stop of the slice are included.

    >>> df.loc['cobra':'viper', 'max_speed']
    cobra    1
    viper    4
    Name: max_speed, dtype: int64

    Boolean list with the same length as the row axis

    >>> df.loc[[False, False, True]]
                max_speed  shield
    sidewinder          7       8

    Alignable boolean Series:

    >>> df.loc[pd.Series([False, True, False],
    ...        index=['viper', 'sidewinder', 'cobra'])]
                max_speed  shield
    sidewinder          7       8

    Index (same behavior as ``df.reindex``)

    >>> df.loc[pd.Index(["cobra", "viper"], name="foo")]
           max_speed  shield
    foo
    cobra          1       2
    viper          4       5

    Conditional that returns a boolean Series

    >>> df.loc[df['shield'] > 6]
                max_speed  shield
    sidewinder          7       8

    Conditional that returns a boolean Series with column labels specified

    >>> df.loc[df['shield'] > 6, ['max_speed']]
                max_speed
    sidewinder          7

    Callable that returns a boolean Series

    >>> df.loc[lambda df: df['shield'] == 8]
                max_speed  shield
    sidewinder          7       8

    **Setting values**

    Set value for all items matching the list of labels

    >>> df.loc[['viper', 'sidewinder'], ['shield']] = 50
    >>> df
                max_speed  shield
    cobra               1       2
    viper               4      50
    sidewinder          7      50

    Set value for an entire row

    >>> df.loc['cobra'] = 10
    >>> df
                max_speed  shield
    cobra              10      10
    viper               4      50
    sidewinder          7      50

    Set value for an entire column

    >>> df.loc[:, 'max_speed'] = 30
    >>> df
                max_speed  shield
    cobra              30      10
    viper              30      50
    sidewinder         30      50

    Set value for rows matching callable condition

    >>> df.loc[df['shield'] > 35] = 0
    >>> df
                max_speed  shield
    cobra              30      10
    viper               0       0
    sidewinder          0       0

    **Getting values on a DataFrame with an index that has integer labels**

    Another example using integers for the index

    >>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
    ...      index=[7, 8, 9], columns=['max_speed', 'shield'])
    >>> df
       max_speed  shield
    7          1       2
    8          4       5
    9          7       8

    Slice with integer labels for rows. As mentioned above, note that both
    the start and stop of the slice are included.

    >>> df.loc[7:9]
       max_speed  shield
    7          1       2
    8          4       5
    9          7       8

    **Getting values with a MultiIndex**

    A number of examples using a DataFrame with a MultiIndex

    >>> tuples = [
    ...    ('cobra', 'mark i'), ('cobra', 'mark ii'),
    ...    ('sidewinder', 'mark i'), ('sidewinder', 'mark ii'),
    ...    ('viper', 'mark ii'), ('viper', 'mark iii')
    ... ]
    >>> index = pd.MultiIndex.from_tuples(tuples)
    >>> values = [[12, 2], [0, 4], [10, 20],
    ...         [1, 4], [7, 1], [16, 36]]
    >>> df = pd.DataFrame(values, columns=['max_speed', 'shield'], index=index)
    >>> df
                         max_speed  shield
    cobra      mark i           12       2
               mark ii           0       4
    sidewinder mark i           10      20
               mark ii           1       4
    viper      mark ii           7       1
               mark iii         16      36

    Single label. Note this returns a DataFrame with a single index.

    >>> df.loc['cobra']
             max_speed  shield
    mark i          12       2
    mark ii          0       4

    Single index tuple. Note this returns a Series.

    >>> df.loc[('cobra', 'mark ii')]
    max_speed    0
    shield       4
    Name: (cobra, mark ii), dtype: int64

    Single label for row and column. Similar to passing in a tuple, this
    returns a Series.

    >>> df.loc['cobra', 'mark i']
    max_speed    12
    shield        2
    Name: (cobra, mark i), dtype: int64

    Single tuple. Note using ``[[]]`` returns a DataFrame.

    >>> df.loc[[('cobra', 'mark ii')]]
                   max_speed  shield
    cobra mark ii          0       4

    Single tuple for the index with a single label for the column

    >>> df.loc[('cobra', 'mark i'), 'shield']
    2

    Slice from index tuple to single label

    >>> df.loc[('cobra', 'mark i'):'viper']
                         max_speed  shield
    cobra      mark i           12       2
               mark ii           0       4
    sidewinder mark i           10      20
               mark ii           1       4
    viper      mark ii           7       1
               mark iii         16      36

    Slice from index tuple to index tuple

    >>> df.loc[('cobra', 'mark i'):('viper', 'mark ii')]
                        max_speed  shield
    cobra      mark i          12       2
               mark ii          0       4
    sidewinder mark i          10      20
               mark ii          1       4
    viper      mark ii          7       1

###### Sort & Rank (Sıralama)

In [11]:
df.sort_index()

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171835
2   Brazil   Brasilia   207847528

In [12]:
df.sort_values(by='Country')

   Country    Capital  Population
0  Belgium   Brussels    11190846
2   Brazil   Brasilia   207847528
1    India  New Delhi  1303171835

In [13]:
df.rank()

   Country  Capital  Population
0      1.0      2.0         1.0
1      3.0      3.0         3.0
2      2.0      1.0         2.0

###### I/O

CVS okuma ve Kaydetme

In [ ]:
pd.read_csv('file.cvs', header=None, nrows=5)

In [16]:
df.to_csv('myDataFrame.cvs')

Excel Okuma ve Yazma

In [ ]:
pd.read_excel('file.xlsx')

In [17]:
df.to_excel('myDataFrame.xlsx', sheet_name='Sheet1')

In [ ]:
xlsx = pd.ExcelFile('file.xls')

In [ ]:
df = pd.read_excel(xlsx, 'sheet1')

SQL Query ve Database Tablo Okuma ve Yazma

In [18]:
from sqlalchemy import create_engine

In [ ]:
engine = create_engine('sqlite:///:memory:')

In [ ]:
pd.read_sql("SELECT * FROM my_table;",engine)

In [ ]:
pd.read_sql_table('my_table', engine)

In [ ]:
pd.read_sql_query("SELECT * FROM my_table;",engine)

In [ ]:
df.to_sql('myDf',engine)

###### Seçim İşlemleri

Getting

In [19]:
s['b']

-5

In [20]:
df[1:]

  Country    Capital  Population
1   India  New Delhi  1303171835
2  Brazil   Brasilia   207847528

Selecting, Boolean Indexing & Setting

Pozisyona Göre

In [27]:
df.iloc[[0],[0]]

   Country
0  Belgium

In [34]:
df.iat[0,0]

'Belgium'

Etikete Göre

In [31]:
df.loc[[0],['Country']]

   Country
0  Belgium

In [33]:
df.at[0,'Country']

'Belgium'

Hem Etiket Hem de Pozisyona Göre

In [ ]:
df.ix[2]

Boolean Indexing

In [39]:
df[df['Population']>1200000000]

  Country    Capital  Population
1   India  New Delhi  1303171835

Setting

In [41]:
s

a    6
b   -5
c    7
d    4
dtype: int64

In [42]:
s['a'] = 15

In [43]:
s

a    15
b    -5
c     7
d     4
dtype: int64

###### retrieving series / dataframe information

Basit Bilgiler

In [44]:
df.shape

(3, 3)

In [45]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [46]:
df.columns

Index(['Country', 'Capital', 'Population'], dtype='object')

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     3 non-null      object
 1   Capital     3 non-null      object
 2   Population  3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [48]:
df.count()

Country       3
Capital       3
Population    3
dtype: int64

Özet

In [49]:
df.sum()

Country              BelgiumIndiaBrazil
Capital       BrusselsNew DelhiBrasilia
Population                   1522210209
dtype: object

In [50]:
df.cumsum()

              Country                    Capital  Population
0             Belgium                   Brussels    11190846
1        BelgiumIndia          BrusselsNew Delhi  1314362681
2  BelgiumIndiaBrazil  BrusselsNew DelhiBrasilia  1522210209

In [51]:
df.min()

Country        Belgium
Capital       Brasilia
Population    11190846
dtype: object

In [52]:
df.max()

Country            India
Capital        New Delhi
Population    1303171835
dtype: object

In [ ]:
df.idxmin()
df.idxmax()

In [54]:
df.describe()

         Population
count  3.000000e+00
mean   5.074034e+08
std    6.961351e+08
min    1.119085e+07
25%    1.095192e+08
50%    2.078475e+08
75%    7.555097e+08
max    1.303172e+09

In [55]:
df.mean()

Population    507403403.0
dtype: float64

In [56]:
df.median()

Population    207847528.0
dtype: float64

###### Fonksiyonların Uygulanması

In [57]:
f = lambda x: x*2

In [58]:
df.apply(f)

          Country             Capital  Population
0  BelgiumBelgium    BrusselsBrussels    22381692
1      IndiaIndia  New DelhiNew Delhi  2606343670
2    BrazilBrazil    BrasiliaBrasilia   415695056

In [59]:
df.applymap(f)

          Country             Capital  Population
0  BelgiumBelgium    BrusselsBrussels    22381692
1      IndiaIndia  New DelhiNew Delhi  2606343670
2    BrazilBrazil    BrasiliaBrasilia   415695056

###### Veri Hizalama

In [61]:
s3= pd.Series([7,-2,3],index=['a','c','d'])

In [63]:
s

a    True
b    True
c    True
d    True
dtype: bool

In [64]:
s3

a    7
c   -2
d    3
dtype: int64

In [65]:
s+s3

a    8.0
b    NaN
c   -1.0
d    4.0
dtype: float64

In [ ]:
s.add(s3, fill_values=8)

In [ ]:
s.sub(s3, fill_values=2)

In [ ]:
s.div(s3, fill_values=3)

In [ ]:
s.nul(s3, fill_values=4)